caonguyenheo/coffee_3220mode/cc3220mode_module/programs/p2p/app/system.c
/*
 * system.c
 *
 *  Created on: Aug 30, 2018
 *      Author: Admin
 */

#include "system.h"
#include "tcp.h"
#include "shelltask.h"
#include "network_handler.h"
#include "sflash.h"
#include "userconfig.h"
#include "main_thread.h"
#include "cc3220_system.h"
#include "ti/net/bsd/sys/socket.h"
#include "ti/net/bsd/arpa/inet.h"

#define TEST_FILENAME_MY        "/sys/test2.txt"
#define FILENAME_MY        		"newfile1.text"

char ap_ssid[MAX_AP_SSID_LEN] = {0};
char ap_pass[MAX_AP_PASS_LEN] = {0};
char ap_sec[MAX_AP_SEC_LEN] = {0};
extern int32_t gMode;
int count_to_reboot=(PERIOD_REBOOT_TIME_MS/1000);
char lineBreak[]                = "\n\r";
unsigned long  g_ulDestinationIp = IP_ADDR;
unsigned int   g_uiPortNum = PORT_NUM;
volatile unsigned long  g_ulPacketCount = TCP_PACKET_COUNT;
unsigned char  g_ucConnectionStatus = 0;
unsigned char  g_ucSimplelinkstarted = 0;
unsigned long  g_ulIpAddr = 0;
char gcBsdBuf_File[BUFF_LEN_FILE]= {0};
char g_cBsdBuf[BUF_LEN]= {0};
char gcBsdBuf_File_Rx[BUFF_LEN_FILE]= {0};
char g_cBsdBuf1[BUF_LEN]= {0};
int audio_mode = -1;
//extern char buff_In[];
extern sem_t guserconfig_init;
void printBorder(char ch, int n);
void DisplayUsage();
static char *ParseString (char *instring);
void PrintIPAddress(unsigned char ipv6, void *ip);
int32_t ipv4AddressParse(char *str, uint32_t *ipv4ip);



void printBorder(char ch, int n)
{
    int        i = 0;

    for(i=0; i<n; i++)
    {
    	putch(ch);
    }
}
void DisplayUsage()
{
	printBorder('=', 100);
	UART_PRINT(lineBreak);
	UART_PRINT("\t\t\t\tAT COMMAND SUPPORT:\r\n");
    UART_PRINT("\tconnect [SSID] [PASSWD]\t");
    UART_PRINT("\tdisconnect\t");
    UART_PRINT("\treboot\n\r");
    UART_PRINT("\tsend -i [ip] -p [port number] [data] [nb 0/1] [tx 0/1]\t");
    UART_PRINT("recv -p [port number] [nb 0/1] [tx 0/1]\n\r");
    UART_PRINT("\tsendfile -i [ip] -p [port number]\t");
    UART_PRINT("\t\trecvfile -p [port number]\n\r");
    UART_PRINT("\tip\t");
    UART_PRINT("\t\t\t\t\t\tclear\n\r"); //clear screen
    UART_PRINT("\tresetfactory\n\r");
    printBorder('=', 100);
    UART_PRINT(lineBreak);

}
int32_t DisplayAppBanner(char* appName, char* appVersion)
{
     int32_t            ret = 0;
     uint8_t            macAddress[SL_MAC_ADDR_LEN];
     uint16_t           macAddressLen = SL_MAC_ADDR_LEN;
     uint16_t           ConfigSize = 0;
     uint8_t            ConfigOpt = SL_DEVICE_GENERAL_VERSION;
     SlDeviceVersion_t ver = {0};

     ConfigSize = sizeof(SlDeviceVersion_t);

    /* Print device version info. */
    ret =
        sl_DeviceGet(SL_DEVICE_GENERAL, &ConfigOpt, &ConfigSize,
                     (uint8_t*)(&ver));
    ASSERT_ON_ERROR(ret, DEVICE_ERROR);

    /* Print device Mac address */
    ret = sl_NetCfgGet(SL_NETCFG_MAC_ADDRESS_GET, 0, &macAddressLen,
                       &macAddress[0]);
    ASSERT_ON_ERROR(ret, WLAN_ERROR);

    UART_PRINT(lineBreak);
    UART_PRINT("\t");
    printBorder('=', 46);
    UART_PRINT(lineBreak);
    UART_PRINT("\t   %s Ver: %s",appName, appVersion);
    UART_PRINT(lineBreak);
    UART_PRINT("\t");
    printBorder('=', 46);
    UART_PRINT(lineBreak);
    UART_PRINT(lineBreak);
    UART_PRINT("\t CHIP: 0x%x",ver.ChipId);
    UART_PRINT(lineBreak);
    UART_PRINT("\t MAC:  %d.%d.%d.%d",ver.FwVersion[0],ver.FwVersion[1],
               ver.FwVersion[2],
               ver.FwVersion[3]);
    UART_PRINT(lineBreak);
    UART_PRINT("\t PHY:  %d.%d.%d.%d",ver.PhyVersion[0],ver.PhyVersion[1],
               ver.PhyVersion[2],
               ver.PhyVersion[3]);
    UART_PRINT(lineBreak);
    UART_PRINT("\t NWP:  %d.%d.%d.%d",ver.NwpVersion[0],ver.NwpVersion[1],
               ver.NwpVersion[2],
               ver.NwpVersion[3]);
    UART_PRINT(lineBreak);
    UART_PRINT("\t ROM:  %d",ver.RomVersion);
    UART_PRINT(lineBreak);
    UART_PRINT("\t HOST: %s", SL_DRIVER_VERSION);
    UART_PRINT(lineBreak);
    UART_PRINT("\t MAC address: %02x:%02x:%02x:%02x:%02x:%02x",
               macAddress[0],
               macAddress[1],
               macAddress[2],
               macAddress[3],
               macAddress[4],
               macAddress[5]);
    UART_PRINT(lineBreak);
    UART_PRINT(lineBreak);
    UART_PRINT("\t");
    printBorder('=', 44);
    UART_PRINT(lineBreak);
    UART_PRINT(lineBreak);

    return(ret);
}
static char *ParseString (char *instring)
{
    char *ptr1 = instring, *ptr2 = instring;

    if (instring == NULL)
        return instring;

    while (isspace (*ptr1))
        ptr1++;

    while (*ptr1)
    {
        if (*ptr1 == '+')
        {
            ptr1++; *ptr2++ = ' ';
        }
        else if (*ptr1 == '%' && isxdigit (*(ptr1 + 1)) && isxdigit (*(ptr1 + 2)))
        {
            ptr1++;
            *ptr2    = ((*ptr1 >= '0' && *ptr1 <= '9') ? (*ptr1 - '0') : ((char)toupper(*ptr1) - 'A' + 10)) << 4;
            ptr1++;
            *ptr2++ |= ((*ptr1 >= '0' && *ptr1 <= '9') ? (*ptr1 - '0') : ((char)toupper(*ptr1) - 'A' + 10));
            ptr1++;
        }
        else
            *ptr2++ = *ptr1++;
    }

    /*while (ptr2 > instring && isspace(*(ptr2 - 1)))
        ptr2--;*/

    *ptr2 = '\0';

    return instring;
}
void PrintIPAddress(unsigned char ipv6,
                    void *ip)
{
    uint32_t        *pIPv4;
    uint8_t         *pIPv6;
    int32_t          i=0;

    if(!ip)
    {
        return;
    }

    if(ipv6)
    {
        pIPv6 = (uint8_t*) ip;

        for(i = 0; i < 14; i+=2)
        {
            UART_PRINT("%02x%02x:", pIPv6[i], pIPv6[i+1]);
        }

        UART_PRINT("%02x%02x", pIPv6[i], pIPv6[i+1]);
    }
    else
    {
        pIPv4 = (uint32_t*)ip;
        UART_PRINT("%d.%d.%d.%d",
                    SL_IPV4_BYTE(*pIPv4,3),
                    SL_IPV4_BYTE(*pIPv4,2),
                    SL_IPV4_BYTE(*pIPv4,1),
                    SL_IPV4_BYTE(*pIPv4,0));
    }
    return;
}
int32_t ipv4AddressParse(char *str, uint32_t *ipv4ip)
{
    volatile int32_t i = 0;
    uint32_t n;
    uint32_t ipv4Address = 0;
    char             *token;

    token = strtok(str, ".");
    if(token)
    {
        n = (int)strtoul(token, 0, 10);
    }
    else
    {
        return(-1);
    }

    while(i < 4)
    {
       if((token != NULL) && (n < 256))
       {
           ipv4Address |= n;
           if(i < 3)
           {
               ipv4Address = ipv4Address << 8;
           }
           token=strtok(NULL,".");
           if (token)
           {
               n = (int)strtoul(token, 0, 10);
           }
           i++;
       }
       else
       {
           return -1;
       }
    }
    *ipv4ip = ipv4Address;
/*    ipv4ip = &ipv4Address;
    UART_PRINT("ipv4ip parser:%x\n\r", *ipv4ip);*/
    return(0);
}
int sec_string_to_num()
{
	int l_len=strlen(ap_sec);
	int i;
//	int iRetval = -1;
	for(i=0;i<l_len;i++)
	{
		ap_sec[i]=tolower(ap_sec[i]);
	}
	UART_PRINT("Wifi Sec %s\r\n",ap_sec);
	if (strcmp (ap_sec, "open" )==0)
	{
//		iRetval = 0;
		return 0;
	}
	if (strcmp (ap_sec, "wep" )==0)
	{
//		iRetval = 1;
		return 1;
	}
	if (strcmp (ap_sec, "wpa" )==0)
	{
//		iRetval = 2;
		return 2;
	}

	return 2;
}
int32_t set_wireless_config(char *ssid, char *pass, char *auth_type)
{
    // auth_type not used
    if (ssid == NULL || pass == NULL)
    {
        return -1;
    }
    // URL decoder
    ParseString(ssid);
    ParseString(pass);
    UART_PRINT("SSID:%s, PASS:%s, SEC:%s\r\n", ssid, pass, auth_type);

