caonguyenheo/coffee_3220mode/cc3220mode_module/programs/p2p/app/system.c
    memset(ap_ssid, 0, MAX_AP_SSID_LEN);
    memset(ap_pass, 0, MAX_AP_PASS_LEN);
    memset(ap_sec, 0, MAX_AP_SEC_LEN);

    memcpy(ap_ssid, ssid, strlen((char const *)ssid));
    memcpy(ap_pass, pass, strlen((char const *)pass));
    memcpy(ap_sec, auth_type, strlen((char const *)auth_type));

    return 0;
}

int32_t get_wireless_config()
{
	int ret_val = -1;

    ret_val = userconfig_get(ap_ssid, MAX_AP_SSID_LEN, WIFI_SSID_ID);
    if (ret_val < 0)
    {
        UART_PRINT("Can not read WIFI SSID, error=%d\r\n", ret_val);
    }

    ret_val = userconfig_get(ap_pass, MAX_AP_PASS_LEN, WIFI_KEY_ID);
    if (ret_val < 0)
    {
        UART_PRINT("Can not read WIFI KEY, error=%d\r\n", ret_val);
    }

    UART_PRINT("Get SSID and PASS\n\r");
    UART_PRINT("SSID:%s, PASS:%s\n\r", ap_ssid, ap_pass);
    return ret_val;
}

void fw_version_format(char* l_output, char* l_input)
{
	l_output[0]=l_input[0];
	l_output[1]=l_input[1];
	l_output[2]='.';
	l_output[3]=l_input[2];
	l_output[4]=l_input[3];
	l_output[5]='.';
	l_output[6]=l_input[4];
	l_output[7]=l_input[5];
	l_output[8]=0;
}

int ParseNProcessCmd1(char *pcCmdBuffer)
{
	char *pcInpString;
	int iRetVal = -1;
	pcInpString = strtok(pcCmdBuffer, " ");
	if ((!strcmp(pcInpString, "s")) || (!strcmp(pcInpString, "S")))
	{
		char *ssid = NULL;
		char *passwd = NULL;
		char *authtype = NULL;

		int lRetVal;

		ssid = strtok(NULL, " ");
		if (ssid == NULL)
		{
			return -1;
		}
		passwd = strtok(NULL, " ");
		if (passwd == NULL)
		{
			return -1;
		}

		authtype = strtok(NULL, " ");
		if (authtype == NULL)
		{
			return -1;
		}

		UART_PRINT("\r\n\t- TRY TO CONNECT: %s %s %s\r\n", ssid, passwd, authtype);
		set_wireless_config(ssid, passwd, authtype);
		Network_IF_DeInitDriver();
		lRetVal = Network_IF_InitDriver(ROLE_STA);
		if (lRetVal < 0)
		{
			ERR_PRINT(lRetVal);
			return REGISTRATION_ERROR_SETMODESTA;
		}
		lRetVal = Network_IF_Connect2AP_static_ip(ssid, passwd, 5);

		if (lRetVal<0)
		{
			UART_PRINT("Connect to AP fail\n");
			return REGISTRATION_ERROR_CONNECTAP;
		}

		return lRetVal;
	}
	else if(!strcmp(pcInpString, "scan"))
	{
	    sl_WlanProfileDel(0xFF);
	    ConfigureSimpleLinkToDefaultState(gMode);
	    InitializeAppVariables();
		Network_IF_provisionAP();
	    sl_Stop(0xFF);
	    iRetVal = Network_IF_WifiSetMode(ROLE_AP);

	    if (iRetVal < 0)
	    {
	        return REGISTRATION_ERROR_SETMODEAP;
	    }
	    iRetVal = 1;
	}
	else if(!strcmp(pcInpString, "clear"))
	{
		ClearTerm();
	    iRetVal = 1;
	}
	return iRetVal;
}
int system_init(void)
{
//	int RetVal = -1;
//	InitFile_Test();
	int ret_val = -1;

//	sl_Start(0, 0, 0);


	userconfig_init();
	userconfig_flash_read();
	sem_post(&guserconfig_init);

    ret_val = userconfig_get(ap_ssid, MAX_AP_SSID_LEN, WIFI_SSID_ID);
    if (ret_val < 0)
    {
        UART_PRINT("Can not read WIFI SSID, error=%d\r\n", ret_val);
    }

    ret_val = userconfig_get(ap_pass, MAX_AP_PASS_LEN, WIFI_KEY_ID);
    if (ret_val < 0)
    {
        UART_PRINT("Can not read WIFI KEY, error=%d\r\n", ret_val);
    }

    UART_PRINT("SSID:%s, PASS:%s\r\n", ap_ssid, ap_pass);
/*    UART_PRINT("\r\nNetwork init start\r\n");

    InitializeAppVariables();
    Network_IF_provisionAP();*/

	return 0;
}
void system_reboot()
{
	/*
    PRCMMCUReset(TRUE);
    // PRCMSOCReset();
	*/

	// Another reboot method
	sl_WlanPolicySet(SL_POLICY_PM , SL_LOW_LATENCY_POLICY, NULL, 0);
//	sl_Stop(0);
	MAP_PRCMHibernateWakeupSourceEnable(PRCM_HIB_SLOW_CLK_CTR);
	MAP_UtilsDelay(8000000);
	MAP_PRCMHibernateIntervalSet(330);
	MAP_PRCMHibernateEnter();
    while(1);

}
void system_reboot_1()
{

    PRCMMCUReset(TRUE);
}

int system_registration()
{
	int RetVal = 0;
//	char acCmdStore[512];

    UART_PRINT("Network init start\n\r");

    sl_WlanProfileDel(0xFF);
    ConfigureSimpleLinkToDefaultState(gMode);
    InitializeAppVariables();
    RetVal = Network_IF_WifiSetMode(ROLE_STA);
    if (RetVal < 0)
    {
        return REGISTRATION_ERROR_SETMODESTA;
    }

    UART_PRINT("Network init done\n\r");
    Network_IF_provisionAP();
    UART_PRINT("Scan wifi done\n\r");
    RetVal = sl_Stop(0xFF);
    RetVal = Network_IF_WifiSetMode(ROLE_AP);

    if (RetVal < 0)
    {
        return REGISTRATION_ERROR_SETMODEAP;
    }

#if 1

    char acCmdStore[512];
    do
    {

    	UART_PRINT("Select SSID:");
    	UART_PRINT("\n\r");
		RetVal = GetCmd(acCmdStore, sizeof(acCmdStore));

		if (RetVal < 0)
		{

			UART_PRINT("Command length exceeded 512 bytes in system \n\r");
		}
		else
		{
			RetVal = ParseNProcessCmd1(acCmdStore);
			if (RetVal < 0)
			{
				UART_PRINT("Error in processing command in system\n\r");
			}
		}
		UART_PRINT("\n\r");
    }while(RetVal != 0);

#if 0
    char SSID[32]="AlincoVN2";
    char SSID_KEY[64]="aevn2016";
    char AUTHTYPE[8]="WPA";
	set_wireless_config(SSID, SSID_KEY, AUTHTYPE);
#endif

#endif

#if 0
    RetVal = Network_IF_Connect2AP_static_ip(ap_ssid, ap_pass, 0);
    if (RetVal<0)
    {

        UART_PRINT("Connect to AP fail\n");

        return REGISTRATION_ERROR_CONNECTAP;
    }
#endif

    RetVal = userconfig_set(ap_ssid, strlen(ap_ssid), WIFI_SSID_ID);
    if (RetVal < 0)
    {
		UART_PRINT("Cannot write ap_ssid, error=%d\n\r", RetVal);
    }

    RetVal= userconfig_set(ap_pass, strlen(ap_pass), WIFI_KEY_ID);
    if (RetVal < 0)
    {
		UART_PRINT("Cannot write ap_pass, error=%d\n\r", RetVal);
    }

    RetVal = userconfig_set(NULL, DEV_REGISTERED, MODE_ID);
    if (RetVal < 0)
    {
        UART_PRINT("Cannot write boot flag, error=%d\r\n", RetVal);
    }
    userconfig_flash_write();

    return RetVal;
}
int system_IsRegistered()
{
    int modeID;

    if ((modeID = userconfig_get(NULL, 0, MODE_ID)) < 0)
    {
    	 UART_PRINT("MODE_GET_CONFIG_FAIL, error=%d\r\n", modeID);
        return -1;
    }
    if (modeID != DEV_REGISTERED)
    {
    	audio_mode = DEV_NOT_REGISTERED;
    	UART_PRINT("MODE_GET_CONFIG DEV_NOT_REGISTERED %d\r\n", audio_mode);
        return -1;
    }
    else
    {
    	 audio_mode = DEV_REGISTERED;
    	 UART_PRINT("MODE_GET_CONFIG DEV_REGISTERED %d\r\n", audio_mode);
        return 0;
    }
}

int SendFile_Tcp(unsigned int uip, unsigned short  usPort)
{
	int             iCounter;
	int             iAddrSize;
	int             iSockID;
	int             iStatus;
	int             itx = 1;

