caonguyenheo/coffee_3220mode/cc3220mode_module/programs/p2p/app/system.c
	SlSockAddr_t	*sa;
	sockAddr_t 		sAddr;
	int32_t         nonBlocking;
	long 			buflen;
	unsigned long   Offset = 0;
	_i32 fd = -1;
	int nb			= 0;


	Offset = 0;
//	sl_Start(0, 0, 0);
	fd = sl_FsOpen(TEST_FILENAME_MY, SL_FS_READ, 0);
	if(fd < 0)
	{
		UART_PRINT("sl_FsOpen error: %d\n\r", fd);
	}
	else
	{
		UART_PRINT("Reading file\n\r");
		buflen =  sl_FsRead(fd, Offset, (_u8*)gcBsdBuf_File, MAX_FILE_SIZE);
		UART_PRINT("Read \"%s\" (%d bytes)...\n\r", gcBsdBuf_File, buflen);
	}

	//filling the TCP server socket address
	sAddr.in4.sin_family = SL_AF_INET;
	sAddr.in4.sin_port = sl_Htons((unsigned short)usPort);
	sAddr.in4.sin_addr.s_addr = sl_Htonl((unsigned int)uip);

	sa = (SlSockAddr_t*)&sAddr.in4;
	iAddrSize = sizeof(SlSockAddrIn_t);

	// creating a TCP socket
	iSockID = sl_Socket(sa->sa_family, SL_SOCK_STREAM, 0);
	ASSERT_ON_ERROR(iSockID, SL_SOCKET_ERROR);

	if(nb == TRUE)
	{
		nonBlocking = TRUE;
		iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_NONBLOCKING, &nonBlocking, sizeof(nonBlocking));

		if(iStatus< 0)
		{
			UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus,
					   SL_SOCKET_ERROR);
			sl_Close(iSockID);
			return(-1);
		}
	}
	iStatus = -1;

	// connecting to TCP server
	while(iStatus < 0)
	{

		iStatus = sl_Connect(iSockID, sa, iAddrSize);
		UART_PRINT("iStatus %d\n\r", iStatus);
		if((iStatus == SL_ERROR_BSD_EALREADY)&& (nb == TRUE))
		{
			sleep(1);
			continue;
		}
		else if(iStatus < 0)
		{
			UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus, SL_SOCKET_ERROR);
			sl_Close(iSockID);
			return(-1);
		}
		break;
	}

	iCounter = 0;
	if(itx == 1)
	{
		while(iCounter < 1)
		{
			/* Send packets to the server */
			iStatus = sl_Send(iSockID, &gcBsdBuf_File, buflen, 0);
			if((iStatus == SL_ERROR_BSD_EAGAIN) && (nb == TRUE))
			{
				sleep(1);
				continue;
			}
			else if(iStatus < 0)
			{
				UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus, SL_SOCKET_ERROR);
				sl_Close(iSockID);
				return(-1);
			}
			iCounter++;
		}
		UART_PRINT("Sent %u packets (%u bytes) (data:%s) successfully\n\r", iCounter, buflen, gcBsdBuf_File);

	}

	iStatus = sl_Close(iSockID);
	ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);

	fd = sl_FsClose(fd, 0, 0, 0);
	if(fd < 0)
	{
		UART_PRINT("sl_FsClose error: %d\n\r", fd);
	}
	return 0;
}

int ReceFile_Tcp(unsigned short  usPort)
{

//	int32_t             iCounter;
	int32_t             iAddrSize;
	int32_t				iSockID;
	int32_t            	iStatus;
	int32_t             iNewSockID = -1;
	int32_t         	lNonBlocking = FALSE;
	_i32            RetVal = -1;
	SlSockAddr_t    *sa;
	SlSockAddr_t    *csa;
	sockAddr_t 		sAddr;
	int nb			= 0;
	int rx			= 1;
	_i32 fd 		= -1;
	unsigned long   Offset = 0;
	long 			buflen = 0;
//	sl_Start(0, 0, 0);

	SlFsFileInfo_t FsFileInfo;

	if(sl_FsGetInfo(FILENAME_MY, 0, &FsFileInfo) < 0)
	{
		UART_PRINT("Prepare Create File\n\r");
		fd = sl_FsOpen((unsigned char *)FILENAME_MY, (SL_FS_CREATE | SL_FS_WRITE  | SL_FS_CREATE_MAX_SIZE(MAX_FILE_SIZE_NEW)), 0);
		if(fd < 0)
		{
			UART_PRINT("sl_FsOpen error ReceFile_Tcp: %d\n\r", fd);
			return fd;
		}
		else
		{
			UART_PRINT("Create File Success\n\r");
	        RetVal = sl_FsClose(fd, 0, 0, 0);
	        if (SL_RET_CODE_OK != RetVal)
	        {
	            _ASSERT_ON_ERROR(FILE_CLOSE_ERROR);
	        }
		}

	}
	else
	{
		UART_PRINT("File Exists\n\r");
	}
	st_listFiles(40,0);

	    // filling the buffer
	memset(gcBsdBuf_File_Rx, 0x0, sizeof(gcBsdBuf_File_Rx));
//	for (iCounter=0 ; iCounter<1024 ; iCounter++)
//	{
//		gcBsdBuf_File_Rx[iCounter] = (char)(iCounter % 10);
//	}

	sAddr.in4.sin_family = SL_AF_INET;

	/* Set the server's port:
	   We'll receive connection requests on this port */
	sAddr.in4.sin_port = sl_Htons((unsigned short)usPort);
	sAddr.in4.sin_addr.s_addr = SL_INADDR_ANY;

	sa = (SlSockAddr_t*)&sAddr.in4;
	csa = (SlSockAddr_t*)&sAddr.in4;
	iAddrSize = sizeof(SlSockAddrIn_t);
	// creating a TCP socket
	iSockID = sl_Socket(sa->sa_family, SL_SOCK_STREAM, 0);
	ASSERT_ON_ERROR(iSockID, SL_SOCKET_ERROR);



	// binding the TCP socket to the TCP server address
	iStatus = sl_Bind(iSockID, sa, iAddrSize);

	if( iStatus < 0 )
	{
		// error
		UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus,
				   SL_SOCKET_ERROR);
		sl_Close(iSockID);
		return(-1);
	}

	// putting the socket for listening to the incoming TCP connection
	iStatus = sl_Listen(iSockID, 0);
	if( iStatus < 0 )
	{
		UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus,
				   SL_SOCKET_ERROR);
		sl_Close(iSockID);
		return(-1);
	}
	if(nb == TRUE)
	{
		lNonBlocking = TRUE;

		iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_NONBLOCKING,
								&lNonBlocking, sizeof(lNonBlocking));
		if(iStatus < 0)
		{
			UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus,
					   SL_SOCKET_ERROR);
			return(-1);
		}
		iNewSockID = SL_ERROR_BSD_EAGAIN;
	}

	// waiting for an incoming TCP connection
	while( iNewSockID < 0 )
	{
		// accepts a connection form a TCP client, if there is any
		// otherwise returns SL_EAGAIN
		iNewSockID = sl_Accept(iSockID, csa, (SlSocklen_t*)&iAddrSize);
		UART_PRINT("iNewSockID:%d\n\r",iNewSockID);
		if( (iNewSockID == SL_ERROR_BSD_EAGAIN) && nb == TRUE)
		{
			UART_PRINT("Sleep\n\r");
			sleep(1);
		}
		else if( iNewSockID < 0 )
		{
			// error
			UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus, SL_SOCKET_ERROR);
			sl_Close(iNewSockID);
			sl_Close(iSockID);
			return(-1);
		}
	}

	UART_PRINT("Connected to client: ");
	sAddr.in4.sin_addr.s_addr = sl_Htonl(sAddr.in4.sin_addr.s_addr);
	PrintIPAddress(0,(void*)&sAddr.in4.sin_addr);
	UART_PRINT("\n\r");

//	int i = 0;
	if(rx == 1)
	{
		uint32_t rcvd_bytes = 0;
		while(rcvd_bytes < (MAX_FILE_SIZE))
		{
			iStatus = sl_Recv(iNewSockID, &gcBsdBuf_File_Rx, (MAX_FILE_SIZE),0);
			if((iStatus == SL_ERROR_BSD_EAGAIN) && (nb == TRUE))
			{
				sleep(1);
				continue;
			}
			else if(iStatus < 0)
			{
				UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus, BSD_SOCKET_ERROR);
				sl_Close(iSockID);
				return(-1);
			}
			else if(iStatus == 0)
			{
				UART_PRINT("TCP Client closed the connection \n\r");
				break;
			}

			rcvd_bytes += iStatus;
		}

		UART_PRINT("Received %u packets (%u bytes) (data:%s) successfully \n\r",
				   (1), rcvd_bytes, gcBsdBuf_File_Rx);

