caonguyenheo/coffee_3220mode/cc3220mode_module/programs/p2p/app/system.c
		fd = sl_FsOpen(FILENAME_MY, SL_FS_WRITE , 0);
		if(fd < 0)
		{
			UART_PRINT("Not Open File \"%s\" %d To Write\n\r", FILENAME_MY, fd);
		}
		else
		{
			buflen = sl_FsWrite(fd, Offset,(_u8 *)gcBsdBuf_File_Rx, MAX_FILE_SIZE);
			UART_PRINT("Wrote %d bytes...\n\r", buflen);
		}

	}

	iStatus = sl_Close(iNewSockID);
	ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);

	iStatus = sl_Close(iSockID);
	ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);

	sl_FsClose(fd, NULL, NULL , 0);

	Offset = 0;
	fd  = -1;
	buflen = 0;
	fd = sl_FsOpen(FILENAME_MY, SL_FS_READ, 0);
    if(fd < 0)
    {
        UART_PRINT("sl_FsOpen error: %d\n\r", fd);
    }
    else
    {
    	memset(gcBsdBuf_File, 0x0, sizeof(gcBsdBuf_File));
    	buflen = sl_FsRead(fd, Offset, (_u8*)gcBsdBuf_File, MAX_FILE_SIZE);
    	if(buflen > 0)
    	{
			UART_PRINT("Read back %d bytes...\n\r", buflen);
			UART_PRINT("Read from file %s \n\r", gcBsdBuf_File);

    	}

        fd  = sl_FsClose(fd, 0, 0, 0);
        if(fd < 0)
        {
            UART_PRINT("sl_FsClose error: %d\n\r", fd );
        }
    }
	return(0);
}


int TcpClient(unsigned int uip, unsigned short  usPort, char *buff, int nb, int tx)
{
    int             iCounter;
    int             iAddrSize;
    int             iSockID;
    int             iStatus;

    SlSockAddr_t	*sa;
    sockAddr_t 		sAddr;
    int32_t         nonBlocking;
    _u32 TimeOut = 0;
//    start:
    memset(g_cBsdBuf, 0x0, sizeof(g_cBsdBuf));
    // filling the buffer
    for (iCounter=0 ; iCounter<BUFF_SIZE ; iCounter++)
    {
//        g_cBsdBuf[iCounter] = (char)(iCounter % 10);
        g_cBsdBuf[iCounter] =  buff[iCounter];
    }
//    memset(&app_CB.gDataBuffer.nwData, 0x0, sizeof(app_CB.gDataBuffer));
//
//    /* filling the buffer with data */
//    for(iCounter = 0; iCounter < MAX_BUF_SIZE; iCounter++)
//    {
////        app_CB.gDataBuffer.nwData[i] = (char)(i % 10);
//        app_CB.gDataBuffer.nwData[iCounter] = buff[iCounter];
//    }

    //filling the TCP server socket address
    sAddr.in4.sin_family = SL_AF_INET;
    sAddr.in4.sin_port = sl_Htons((unsigned short)usPort);
    sAddr.in4.sin_addr.s_addr = sl_Htonl((unsigned int)uip);

    sa = (SlSockAddr_t*)&sAddr.in4;
    iAddrSize = sizeof(SlSockAddrIn_t);

    // creating a TCP socket
    iSockID = sl_Socket(sa->sa_family, SL_SOCK_STREAM, 0);
    ASSERT_ON_ERROR(iSockID, SL_SOCKET_ERROR);

    if(nb == TRUE)
    {
//        nonBlocking = TRUE;
        nonBlocking = FALSE;
    	SlSockNonblocking_t BlockingOption;
    	BlockingOption.NonBlockingEnabled = 0;
//        TimeOut = 120;
        iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_NONBLOCKING, &BlockingOption, sizeof(BlockingOption));
//        iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_KEEPALIVETIME,( _u8*) &TimeOut, sizeof(TimeOut));
        if(iStatus< 0)
        {
            UART_PRINT("[line:%d], [error:%d], [function: %s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__,
                       SL_SOCKET_ERROR);
            sl_Close(iSockID);
            return(-1);
        }
    }
    iStatus = -1;

    // connecting to TCP server
    while(iStatus < 0)
    {

    	iStatus = sl_Connect(iSockID, sa, iAddrSize);
    	UART_PRINT("iStatus %d\n\r", iStatus);
        if((iStatus == SL_ERROR_BSD_EALREADY)&& (nb == TRUE))
        {
            sleep(1);
            continue;
        }
        else if(iStatus < 0)
        {
            UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
            sl_Close(iSockID);
            return(-1);
        }
        break;
    }

    iCounter = 0;
    if(tx == 1)
    {
		int32_t buflen;
		uint32_t sent_bytes = 0;
		uint32_t bytes_to_send = (1000 * BUFF_SIZE);
		while(sent_bytes < bytes_to_send)
		{

			if(bytes_to_send - sent_bytes >= BUFF_SIZE)
			{
				buflen = BUFF_SIZE;
			}
			else
			{
				buflen = bytes_to_send - sent_bytes;
			}

			/* Send packets to the server */
//			iStatus = sl_Send(iSockID, &g_cBsdBuf, buflen, 0);
			iStatus = sl_Send(iSockID, &g_cBsdBuf, sizeof(g_cBsdBuf), 0);
			//SL_ERROR_BSD_ECONNREFUSED  SL_ERROR_BSD_EAGAIN //
			if((iStatus == SL_ERROR_BSD_EAGAIN) && (nb == TRUE))
			{
				sleep(1);
				continue;
			}
			else if(iStatus < 0)
			{
				UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
				sl_Close(iSockID);
				return(-1);
			}
			iCounter++;
			sent_bytes += iStatus;

		}
		UART_PRINT("Sent %u packets (%u bytes) (data:%s) successfully\n\r", iCounter, sent_bytes, g_cBsdBuf);
		memset(g_cBsdBuf, 0x0, sizeof(g_cBsdBuf));
		iStatus = sl_Recv(iSockID, &g_cBsdBuf, sizeof(g_cBsdBuf), 0);
		if( 0 > iStatus )
		{
			UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
		}
		UART_PRINT("Recv [data:%s] [function:%s] successfully\n\r", g_cBsdBuf, __FUNCTION__);
    }
    else
    {
    	uint32_t rcvd_bytes = 0;

		while(rcvd_bytes < (1000 * BUFF_SIZE))
		{
			iStatus = sl_Recv(iSockID, &g_cBsdBuf, MAX_BUF_SIZE, 0);
			if((iStatus == SL_ERROR_BSD_EAGAIN) && (TRUE == 1))
			{
				UART_PRINT("Sleep rece\n\r");
				sleep(1);
				continue;
			}
			else if(iStatus < 0)
			{
				UART_PRINT("[line:%d, error:%d] %s\n\r", __LINE__, iStatus, BSD_SOCKET_ERROR);
				sl_Close(iSockID);
				return(-1);
			}
			else if(iStatus == 0)
			{
				UART_PRINT("TCP Server closed the connection\n\r");
				break;
			}
			rcvd_bytes += iStatus;
		}

		UART_PRINT("Received %u packets (%u bytes) (data:%s) successfully\n\r",
				   (rcvd_bytes / BUFF_SIZE), rcvd_bytes, &g_cBsdBuf);
    }
    iStatus = sl_Close(iSockID);
    ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);
    return 0;
}

int TcpServer(unsigned short  usPort, int nb, int tx)
{

	int32_t             iCounter;
	int32_t             iAddrSize;
    int32_t				iSockID;
    int32_t            	iStatus;

    int32_t             iNewSockID = -1;
    int32_t         	lNonBlocking = FALSE;

    SlSockAddr_t    *sa;
    SlSockAddr_t    *csa;
    sockAddr_t sAddr;
    _u32 TimeOut = 0;


	SlTimeval_t timeout;
	timeout.tv_sec = 30;
	SlFdSet_t readsds;
	SlFdSet_t writesds;
	int32_t            Status = -1;
    // filling the buffer
    memset(g_cBsdBuf1, 0x0, sizeof(g_cBsdBuf1));
    for (iCounter=0 ; iCounter<BUF_LEN ; iCounter++)
    {
    	g_cBsdBuf1[iCounter] = (char)(iCounter % 10);
    }
//    memset(&app_CB.gDataBuffer.nwData, 0x0, sizeof(app_CB.gDataBuffer));
//
//    /* clear the global data buffer */
//    for(iCounter = 0; iCounter < MAX_BUF_SIZE; iCounter++)
//    {
////        app_CB.gDataBuffer.nwData[i] = (char)(i % 10);
//        app_CB.gDataBuffer.nwData[iCounter] = (char)(iCounter % 10);
//    }
    //filling the TCP server socket address
    sAddr.in4.sin_family = SL_AF_INET;

    /* Set the server's port:
	   We'll receive connection requests on this port */
    sAddr.in4.sin_port = sl_Htons((unsigned short)usPort);
    sAddr.in4.sin_addr.s_addr = SL_INADDR_ANY;

    sa = (SlSockAddr_t*)&sAddr.in4;
    csa = (SlSockAddr_t*)&sAddr.in4;
    iAddrSize = sizeof(SlSockAddrIn_t);
    // creating a TCP socket
    iSockID = sl_Socket(sa->sa_family, SL_SOCK_STREAM, 0);
    ASSERT_ON_ERROR(iSockID, SL_SOCKET_ERROR);



