caonguyenheo/coffee_3220mode/cc3220mode_module/programs/p2p/app/system.c
    sAddr.in4.sin_family = SL_AF_INET;

    /* Set the server's port:
	   We'll receive connection requests on this port */
    sAddr.in4.sin_port = sl_Htons((unsigned short)usPort);
    sAddr.in4.sin_addr.s_addr = SL_INADDR_ANY;

    sa = (SlSockAddr_t*)&sAddr.in4;
    csa = (SlSockAddr_t*)&sAddr.in4;
    iAddrSize = sizeof(SlSockAddrIn_t);
    // creating a TCP socket
    iSockID = sl_Socket(sa->sa_family, SL_SOCK_STREAM, 0);
    ASSERT_ON_ERROR(iSockID, SL_SOCKET_ERROR);

    if(nb == TRUE)
    {
//    	lNonBlocking = TRUE;
    	lNonBlocking = FALSE;
    	SlSockNonblocking_t BlockingOption;
    	SlSockReuseaddr_t  ReuseAddr;
    	ReuseAddr.ReuseaddrEnabled = 1;
    	BlockingOption.NonBlockingEnabled = 0;

        iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_NONBLOCKING,
                                &BlockingOption, sizeof(BlockingOption));
        if(iStatus < 0)
        {
        	UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
            return(-1);
        }

    }


    // binding the TCP socket to the TCP server address
    iStatus = sl_Bind(iSockID, sa, iAddrSize);

    if( iStatus < 0 )
    {
        // error
    	UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
        sl_Close(iSockID);
        return(-1);
    }

    // putting the socket for listening to the incoming TCP connection
    iStatus = sl_Listen(iSockID, 3);
    if( iStatus < 0 )
    {
    	UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
        sl_Close(iSockID);
        return(-1);
    }
    while(1)
    {
		Report("Prepare Connection ...\n\r");

		SL_SOCKET_FD_ZERO(&readsds);
		SL_SOCKET_FD_SET(iSockID, &readsds);
		max_sd = iSockID;

       //add child sockets to set
		for ( iCounter = 0 ; iCounter < max_client ;iCounter++)
		{
			//socket descriptor
			sd = client_socket[iCounter];

			//if valid socket descriptor then add to read list
			if(sd > 0)
			{
				SL_SOCKET_FD_SET(iSockID, &readsds);
			}
			//highest file descriptor number, need it for the select function
			if(sd > max_sd)
			{
				max_sd = sd;
			}
		}
		Status = sl_Select(max_sd + 1, &readsds, NULL, NULL, &timeout);
		if(Status > 0)
		{
			Report("Connection readsds [%d] writesds[%d] Status[%d] \n\r", readsds, writesds, Status);
		}
		if(SL_SOCKET_FD_ISSET(iSockID, &readsds))
		{
			iNewSockID = sl_Accept(iSockID, csa, (SlSocklen_t*)&iAddrSize);
			UART_PRINT("iNewSockID:%d\n\r",iNewSockID);
	        if( iNewSockID < 0 )
	        {
	            // error
	        	UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iNewSockID, __FUNCTION__, SL_SOCKET_ERROR);
	            return(-1);
	        }

	        sAddr.in4.sin_addr.s_addr = sl_Htonl(sAddr.in4.sin_addr.s_addr);
	        PrintIPAddress(0,(void*)&sAddr.in4.sin_addr);
	        UART_PRINT("\n\r");
			UART_PRINT("New connection , socket fd is %d \n\r" , iNewSockID);
			if( sl_Send(iNewSockID, "ECHO Daemon v1.0 \r\n", strlen("ECHO Daemon v1.0 \r\n"), 0) != strlen("ECHO Daemon v1.0 \r\n"))
			{
				UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iNewSockID, __FUNCTION__, SL_SOCKET_ERROR);
			}

			Status  = sl_Recv(iNewSockID, &g_cBsdBuf1, sizeof(g_cBsdBuf1),0);
			UART_PRINT("(data:%s) successfully \n\r", &g_cBsdBuf1);
		    sl_Send(iNewSockID, "ACK", strlen("ACK"), 0);

			for (iCounter = 0; iCounter < max_client; iCounter++)
			{
				//if position is empty
				if( client_socket[iCounter] == 0 )
				{
					client_socket[iCounter] = iNewSockID;
					printf("Adding to list of sockets as %d\n" ,iCounter);
					break;
				}
			}
		}
		for (iCounter = 0; iCounter < max_client; iCounter++)
		{
			sd = client_socket[iCounter];
			if (SL_SOCKET_FD_ISSET( sd , &readsds))
			{
				iStatus = sl_Recv(sd, &g_cBsdBuf1, sizeof(g_cBsdBuf1),0);
				if(iStatus == 0)
				{
					UART_PRINT("Disconnect with\n\r");
					PrintIPAddress(0,(void*)&sAddr.in4.sin_addr);
					UART_PRINT("\n\r");
					sl_Close(sd);
					client_socket[iCounter] = 0;
				}

			}
		}

    }

	return(0);
}

int TcpClient_cp(unsigned int uip, unsigned short  usPort, char *buff, int nb, int tx)
{
    int             iCounter;
    int             iAddrSize;
    int             iSockID;
    int             iStatus;

    SlSockAddr_t	*sa;
    sockAddr_t 		sAddr;
    int32_t         nonBlocking;
    _u32 TimeOut = 0;

    memset(g_cBsdBuf, 0x0, sizeof(g_cBsdBuf));
    // filling the buffer
    for (iCounter=0 ; iCounter<BUFF_SIZE ; iCounter++)
    {
//        g_cBsdBuf[iCounter] = (char)(iCounter % 10);
        g_cBsdBuf[iCounter] =  buff[iCounter];
    }

    //filling the TCP server socket address
    sAddr.in4.sin_family = SL_AF_INET;
    sAddr.in4.sin_port = sl_Htons((unsigned short)usPort);
    sAddr.in4.sin_addr.s_addr = sl_Htonl((unsigned int)uip);

    sa = (SlSockAddr_t*)&sAddr.in4;
    iAddrSize = sizeof(SlSockAddrIn_t);

    // creating a TCP socket
    iSockID = sl_Socket(sa->sa_family, SL_SOCK_STREAM, 0);
    ASSERT_ON_ERROR(iSockID, SL_SOCKET_ERROR);

    if(nb == TRUE)
    {

        nonBlocking = FALSE;
    	SlSockNonblocking_t BlockingOption;
    	BlockingOption.NonBlockingEnabled = 0;
//        TimeOut = 120;
        iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_NONBLOCKING, &BlockingOption, sizeof(BlockingOption));
//        iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_KEEPALIVETIME,( _u8*) &TimeOut, sizeof(TimeOut));
        if(iStatus< 0)
        {
            UART_PRINT("[line:%d], [error:%d], [function: %s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__,
                       SL_SOCKET_ERROR);
            sl_Close(iSockID);
            return(-1);
        }
    }
    iStatus = -1;

    // connecting to TCP server
    while(iStatus < 0)
    {

    	iStatus = sl_Connect(iSockID, sa, iAddrSize);
    	UART_PRINT("iStatus %d\n\r", iStatus);
        if((iStatus == SL_ERROR_BSD_EALREADY)&& (nb == TRUE))
        {
            sleep(1);
            continue;
        }
        else if(iStatus < 0)
        {
            UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
            sl_Close(iSockID);
            return(-1);
        }
        else
        {
			iStatus = sl_Recv(iSockID, &g_cBsdBuf1, sizeof(g_cBsdBuf1), 0);
			if( 0 > iStatus )
			{
				_ASSERT_ON_ERROR(iStatus);
			}
			else
			{
				UART_PRINT("Recv [data:%s] [function:%s] successfully\n\r", g_cBsdBuf1);
			}
        }
        break;
    }

    iCounter = 0;
    if(tx == 1)
    {
		iStatus = sl_Send(iSockID, &g_cBsdBuf, 15, 0);
		_ASSERT_ON_ERROR(iStatus);
		if(iStatus < 0)
		{
			UART_PRINT("[line:%d], [error:%d], [function:%s], [%s]\n\r", __LINE__, iStatus, __FUNCTION__, SL_SOCKET_ERROR);
			sl_Close(iSockID);
			return(-1);
		}

		UART_PRINT(" (data:%s) successfully\n\r", g_cBsdBuf);
		memset(g_cBsdBuf1, 0x0, sizeof(g_cBsdBuf1));
		iStatus = sl_Recv(iSockID, &g_cBsdBuf1, sizeof(g_cBsdBuf1), 0);
		if( 0 > iStatus )
		{
			_ASSERT_ON_ERROR(iStatus);
		}
		else
		{
			UART_PRINT("Recv [data:%s] successfully\n\r", g_cBsdBuf1);
			if(!strcmp(g_cBsdBuf1, "ACK"))
			{

			}
		}

//		memset(g_cBsdBuf, 0x0, sizeof(g_cBsdBuf));

    }
    iStatus = sl_Close(iSockID);
    ASSERT_ON_ERROR(iStatus, SL_SOCKET_ERROR);

    return 0;
}

